--[[******************************************************************************************
    World Entity Spawn Manager Extensions
    
    世界中的Entity出生管理器
    例如：游戏需要确保玩家均匀出生在场景中的各个区域，就需要统筹来管理出生

--******************************************************************************************]]--



--[[------------------------------------------------------------------------------------------
    简单示例：
    FixedPointsSpawnMng : 
]]--------------------------------------------------------------------------------------------

---@class FixedPointsSpawnMng:Object
_class( "FixedPointsSpawnMng", Object )

function FixedPointsSpawnMng:Constructor(points)
    self.AllPoints = points
end